<a href="https://colab.research.google.com/github/Mhsm2012/machine_learning_course/blob/main/data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importing requied libraies

In [2]:
import pandas as pd
import sqlite3 as sq3 # to deal with sqlite data
import pandas.io.sql as pds

In [3]:
# create a path and make a connection to database 
path='/content/classic_rock.db'
con= sq3.Connection(path)

In [7]:
# reading data from database file
query = '''SELECT * FROM rock_songs'''
observations = pd.read_sql(query,con)
observations.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [8]:
query2='''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''
data_from = pd.read_sql(query2,con)
data_from.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000